In [1]:
import pandas as pd
from datetime import datetime 
import time
import numpy as np

In [ ]:
pip install iexfinance

In [3]:
sym = "AAPL"  
token = "pk_6b3ac6169ef64261bca98b281e6e5e93"
df_temp = pd.read_json('https://cloud.iexapis.com/stable/stock/'+sym+'/chart/1d?token='+token+'')

In [ ]:
df_temp

In [5]:
df=df_temp.drop(['close', 'high', 'low', 'volume', 'label', 'average', 'notional', 'numberOfTrades' ], axis=1)

In [6]:
df

          date minute     open
0   2020-10-08  09:30  116.270
1   2020-10-08  09:31  116.080
2   2020-10-08  09:32  115.810
3   2020-10-08  09:33  115.950
4   2020-10-08  09:34  115.690
..         ...    ...      ...
228 2020-10-08  13:18  115.070
229 2020-10-08  13:19  115.080
230 2020-10-08  13:20  115.020
231 2020-10-08  13:21  115.040
232 2020-10-08  13:22  115.025

[233 rows x 3 columns]

In [7]:
df.dtypes

date      datetime64[ns]
minute            object
open             float64
dtype: object

In [8]:
df['minute']= pd.to_datetime(df['minute'])

In [9]:
df['datetime']=df.apply(lambda x:'%s %s' % (x['date'],x['minute']),axis=1)

In [11]:
df.drop(['date', 'datetime'], axis=1, inplace=True)
df

                 minute     open
0   2020-10-08 09:30:00  116.270
1   2020-10-08 09:31:00  116.080
2   2020-10-08 09:32:00  115.810
3   2020-10-08 09:33:00  115.950
4   2020-10-08 09:34:00  115.690
..                  ...      ...
228 2020-10-08 13:18:00  115.070
229 2020-10-08 13:19:00  115.080
230 2020-10-08 13:20:00  115.020
231 2020-10-08 13:21:00  115.040
232 2020-10-08 13:22:00  115.025

[233 rows x 2 columns]

In [12]:
df.rename(columns={'minute': 'datetime'}, inplace=True)
df

               datetime     open
0   2020-10-08 09:30:00  116.270
1   2020-10-08 09:31:00  116.080
2   2020-10-08 09:32:00  115.810
3   2020-10-08 09:33:00  115.950
4   2020-10-08 09:34:00  115.690
..                  ...      ...
228 2020-10-08 13:18:00  115.070
229 2020-10-08 13:19:00  115.080
230 2020-10-08 13:20:00  115.020
231 2020-10-08 13:21:00  115.040
232 2020-10-08 13:22:00  115.025

[233 rows x 2 columns]

In [13]:
df['ts'] = df.datetime.values.astype(np.int64) // 10 ** 9
df

               datetime     open          ts
0   2020-10-08 09:30:00  116.270  1602149400
1   2020-10-08 09:31:00  116.080  1602149460
2   2020-10-08 09:32:00  115.810  1602149520
3   2020-10-08 09:33:00  115.950  1602149580
4   2020-10-08 09:34:00  115.690  1602149640
..                  ...      ...         ...
228 2020-10-08 13:18:00  115.070  1602163080
229 2020-10-08 13:19:00  115.080  1602163140
230 2020-10-08 13:20:00  115.020  1602163200
231 2020-10-08 13:21:00  115.040  1602163260
232 2020-10-08 13:22:00  115.025  1602163320

[233 rows x 3 columns]

In [14]:
df.drop(['datetime'], axis=1, inplace=True)
df

        open          ts
0    116.270  1602149400
1    116.080  1602149460
2    115.810  1602149520
3    115.950  1602149580
4    115.690  1602149640
..       ...         ...
228  115.070  1602163080
229  115.080  1602163140
230  115.020  1602163200
231  115.040  1602163260
232  115.025  1602163320

[233 rows x 2 columns]